app/Controllers/Auth.php

    public function login()
    {
        $session = session();

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $konsumen = new KonsumenModel();
        $data = $konsumen->where('username', $username)->first();

        $admin = new AdminModel();
        $data2 = $admin->where('username', $username)->first();
---
SELECT *
FROM `user_konsumen`
WHERE `username` = 'Admin'
 LIMIT 1
SELECT *
FROM `user_admin`
WHERE `username` = 'Admin'
 LIMIT 1