app/Controllers/Payment.php

    public function createOrder()
    {
        $session = session();

        // Data untuk tabel pesan
        $id_user_konsumen = $this->request->getPost('id_user_konsumen');
        $total_harga = $this->request->getPost('total_harga');
        $this->PayModel->save([
            'id_user_konsumen' => $id_user_konsumen,
            'total_harga' => $total_harga
        ]);

        // Data untuk tabel detail_pesan
        $id_order = $this->PayModel->insertID();
        $nama = $this->request->getPost('nama');
        $phone = $this->request->getPost('phone');
        $alamat = $this->request->getPost('alamat');
        $produk = $this->request->getPost('produk');
        $total_produk = $this->request->getPost('total_produk');
        $total_harga = $this->request->getPost('total_harga');
        $this->DetailPesanModel->save([
            'id_order' => $id_order,
            'id_user_konsumen' => $id_user_konsumen,
            'nama' => $nama,
            'phone' => $phone,
            'alamat' => $alamat,
            'produk' => $produk,
            'total_produk' => $total_produk,
            'total_harga' => $total_harga
        ]);
---
INSERT INTO `detail_pesan` (`id_order`, `id_user_konsumen`, `nama`, `phone`, `alamat`, `produk`, `total_produk`, `total_harga`, `created_at`, `updated_at`) VALUES (33, '8', 'Brain Daniel', '0076523552780 (example)', 'Bandung, Gedebage', 'Kue Nastar - x5 - Rp 450.000', '5', '450000', '2025-08-21 10:44:40', '2025-08-21 10:44:40')