app/Models/DetailPesanModel.php

SELECT COUNT(*) AS `numrows`
FROM `detail_pesan`
---
    public function getTotalPesan()
    {
        return $this->countAllResults();