app/Models/HomeModel.php

SELECT `kue`.*, `pictures`.`file`
FROM `kue`
LEFT JOIN `pictures` ON `pictures`.`id_kue` = `kue`.`id_kue`
WHERE `kue`.`id_kue` = '1'
---
    public function getKueWithPictures($id_kue)
    {
        return $this->select('kue.*, pictures.file')
            ->join('pictures', 'pictures.id_kue = kue.id_kue', 'left')
            ->where('kue.id_kue', $id_kue)
            ->findAll();