app/Models/KonsumenModel.php

    public function getTotalKonsumen()
    {
        return $this->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `user_konsumen`