app/Models/MetodeTransaksiModel.php

SELECT *
FROM `transaksi`
---
    public function getMotodeT()
    {
        return $this->findAll();