app/Models/PayModel.php

SELECT *
FROM `pesan`
JOIN `detail_pesan` ON `pesan`.`id_order` = `detail_pesan`.`id_order`
WHERE `pesan`.`id_user_konsumen` = '8'
---
    public function getOrdersByUserId($id_user_konsumen)
    {
        $builder = $this->db->table('pesan');
        $builder->select('*');
        $builder->join('detail_pesan', 'pesan.id_order = detail_pesan.id_order');
        $builder->where('pesan.id_user_konsumen', $id_user_konsumen);
        $query = $builder->get();