app/Models/PesanModel.php

SELECT COUNT(*) AS `numrows`
FROM `pesan`
WHERE `status` = 'Menunggu Transaksi'
---
    public function countByStatus($status)
    {
        return $this->where('status', $status)->countAllResults();

SELECT `pesan`.*, `detail_pesan`.`nama`, `detail_pesan`.`phone`, `detail_pesan`.`alamat`, `detail_pesan`.`produk`, `detail_pesan`.`total_produk`, `detail_pesan`.`total_harga` as `detail_total_harga`
FROM `pesan`
JOIN `detail_pesan` ON `detail_pesan`.`id_order` = `pesan`.`id_order` AND `detail_pesan`.`id_user_konsumen` = `pesan`.`id_user_konsumen`
---
    public function JoinedDataPesan()
    {
        return $this->db->table('pesan')
            ->join('detail_pesan', 'detail_pesan.id_order = pesan.id_order AND detail_pesan.id_user_konsumen = pesan.id_user_konsumen')
            ->select('pesan.*, detail_pesan.nama, detail_pesan.phone, detail_pesan.alamat, detail_pesan.produk, detail_pesan.total_produk, detail_pesan.total_harga as detail_total_harga')
            ->get()
            ->getResultArray();

SELECT `pesan`.*, `detail_pesan`.`nama`, `detail_pesan`.`phone`, `detail_pesan`.`alamat`, `detail_pesan`.`produk`, `detail_pesan`.`total_produk`, `detail_pesan`.`total_harga` as `detail_total_harga`
FROM `pesan`
JOIN `detail_pesan` ON `detail_pesan`.`id_order` = `pesan`.`id_order` AND `detail_pesan`.`id_user_konsumen` = `pesan`.`id_user_konsumen`
WHERE `pesan`.`status` = 'Menunggu Transaksi'
---
    public function getMenungguTransaksi()
    {
        return $this->db->table('pesan')
            ->join('detail_pesan', 'detail_pesan.id_order = pesan.id_order AND detail_pesan.id_user_konsumen = pesan.id_user_konsumen')
            ->select('pesan.*, detail_pesan.nama, detail_pesan.phone, detail_pesan.alamat, detail_pesan.produk, detail_pesan.total_produk, detail_pesan.total_harga as detail_total_harga')
            ->where('pesan.status', 'Menunggu Transaksi')
            ->get()
            ->getResultArray();

SELECT `pesan`.*, `detail_pesan`.`nama`, `detail_pesan`.`phone`, `detail_pesan`.`alamat`, `detail_pesan`.`produk`, `detail_pesan`.`total_produk`, `detail_pesan`.`total_harga` as `detail_total_harga`
FROM `pesan`
JOIN `detail_pesan` ON `detail_pesan`.`id_order` = `pesan`.`id_order` AND `detail_pesan`.`id_user_konsumen` = `pesan`.`id_user_konsumen`
WHERE `pesan`.`status` = 'Dikonfirmasi & Dikirim'
---
    public function getDikonfirm()
    {
        return $this->db->table('pesan')
            ->join('detail_pesan', 'detail_pesan.id_order = pesan.id_order AND detail_pesan.id_user_konsumen = pesan.id_user_konsumen')
            ->select('pesan.*, detail_pesan.nama, detail_pesan.phone, detail_pesan.alamat, detail_pesan.produk, detail_pesan.total_produk, detail_pesan.total_harga as detail_total_harga')
            ->where('pesan.status', 'Dikonfirmasi & Dikirim')
            ->get()
            ->getResultArray();