app/Models/PicturesModel.php

SELECT *
FROM `pictures`
---
    public function getKueData2()
    {
        return $this->findAll();

SELECT *
FROM `pictures`
WHERE `id_kue` = '1'
---
    public function getKuePictures($id_kue)
    {
        return $this->where('id_kue', $id_kue)->findAll();