app/Models/TransaksiModel.php

    public function getTransaksi()
    {
        return $this->findAll();
---
SELECT *
FROM `transaksi`